VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/baseline_medium_Re140/01_openfoam_setup/Allrun
#!/bin/bash

source /home/kik/openfoam/OpenFOAM-v2512/etc/bashrc
set -eo pipefail
cd "$(dirname "$0")"
rm -rf 0
cp -r 0.orig 0
mkdir -p logs
blockMesh | tee logs/blockMesh.log
snappyHexMesh -overwrite | tee logs/snappyHexMesh.log
checkMesh | tee logs/checkMesh.log
setExprFields | tee logs/setExprFields.log
pimpleFoam | tee logs/pimpleFoam.log
